[
    {
            "name": "Winson Herry",
            "review": "You wouldn't think that a hammer could be impressive, but this one is. It is very well made and feels good in the hand. Definitely go with the 16oz over the 20oz if the user isn't particularly strong as the weight will begin to matter over the span of the day. I've always found Craftsman tools to be well made and even though they're now owned/made by Stanley Black & Decker, the quality hasn't diminished (though Stanley also has a great longtime reputation).",
            "rating": 3
    },
    {
            "name": "Phillip R. Berger",
            "review": "I have over 50 years experience in contracting and cabinet making, I bought this as a cheap backup hammer for a project far from home so I won't have to bring all my tools. The hammer has a surface and angle that will bend even a #6 nail. Bad design. Not like the classic Craftsman hammers that were very useable. Bought a 12 oz. Estwing, great hammer but cost more. That with my 24oz. framing hammer and I am ok for the rest of the job.",
            "rating": 2.5
    },
    {
            "name": "Anita D. Pierson",
            "review": "You wouldn't think that a hammer could be impressive, but this one is. It is very well made and feels good in the hand. Definitely go with the 16oz over the 20oz if the user isn't particularly strong as the weight will begin to matter over the span of the day. I've always found Craftsman tools to be well made and even though they're now owned/made by Stanley Black & Decker, the quality hasn't diminished (though Stanley also has a great longtime reputation).",
            "rating": 4.5
    },
    {
            "name": "Grant V. Jones",
            "review": "Ok first off this is a standard weight, all purpose claw hammer. The features section asked three questions and the very first one was 'light weight?'. No it's isn't, it's a medium weight hammer. It's not a 12 OZ hammer and not a 22 OZ hammer, it's a 16 OZ (one pound to pound in nails) hammer, so now that that's out of the way the rest is just simple logic. It has two main parts, a handle and a head. The head has two ends, the hammer face and the claws (claw hammer). You hold it by the handle, hit the nails with the face and pull the nails you didn't hit right and bent with the claws while trying not to hit yourself with either end. That's it, that's really all there is to it.",
            "rating": 4
    },
    {
            "name": "Leslie C. Burdine",
            "review": "My husband loves his new Craftsman Hammer! He needed a hammer for the tool box that he keeps in the trunk of his car. He does most of the mechanic work on both of our cars so he keeps a tool box in his truck specifically for mechanic work. The only tool he was missing was a hammer, so I decided to grab this one from Amazon for 2 simple reasons- I recognized the Craftsman brand and it was an affordable price. Easy as that, and he is very happy with it. He says it feels light, the design fits nicely in his hand, it has a good grip and it's well made.",
            "rating": 5
    }
]